{
  "exercises": 
  [
    {
      "name": "Pushups",
      "type": "strength",
      "muscle": "chest",
      "equipment": "body_only",
      "difficulty": "beginner",
      "instructions": "Lie on the floor face down and place your hands shoulder width apart while holding your torso up at arms length. Next, lower yourself downward until your chest almost touches the floor. Breathe and press your upper body back up to the starting position while squeezing your chest. After a brief pause, repeat for as many repitions as needed.  Variations: Bend your legs at the knees to take off resistance or perform the exercise against the wall instead of the floor.",
      "image": "https://media2.giphy.com/media/5t9IcXiBCyw60XPpGu/giphy.gif?cid=ecf05e478kgm8ozhfrjdecouhm3nik2ew1f5c1rnr3ddmlhc&rid=giphy.gif&ct=g"
    },
    {
      "name": "Close-grip bench press",
      "type": "strength",
      "muscle": "chest",
      "equipment": "barbell",
      "difficulty": "intermediate",
      "instructions": "Lie back on a flat bench. Using a close grip (around shoulder width), lift the bar from the rack and hold it straight over you with your arms locked (Use a spotter if needed). This will be your starting position. As you breathe in, come down slowly until you feel the bar on your middle chest. Keep the elbows close to the torso. After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. When you are done, place the bar back in the rack.",
      "image": "https://i0.wp.com/www.strengthlog.com/wp-content/uploads/2020/02/Smalb%C3%A4nk.gif?resize=600%2C600&ssl=1"
    },
    {
      "name": "Dumbbell Bench Press",
      "type": "strength",
      "muscle": "chest",
      "equipment": "dumbbell",
      "difficulty": "expert",
      "instructions": "Lie down on a flat bench with a dumbbell in each hand resting on top of your thighs. Then, using your thighs to help raise the dumbbells up, lift the dumbbells one at a time in front of you at shoulder width. The dumbbells should be just to the sides of your chest, with your upper arm and forearm creating a 90 degree angle. This will be your starting position. Then, as you breathe out, use your chest to push the dumbbells up. Lock your arms at the top of the lift and squeeze your chest, hold for a second and then begin coming down slowly. Repeat for as many repetitions as needed. When finished, lift your legs from the floor bending at the knees, and place the dumbbells on top of your thighs. Use your body's momentum to help you get back to a sitting position.",
      "image": "https://hips.hearstapps.com/hmg-prod/images/workouts/2017/04/inclinedumbbellbenchpress-1492108229.gif"
    },
    {
      "name": "Step-up with knee raise",
      "type": "strength",
      "muscle": "glutes",
      "equipment": "body_only",
      "difficulty": "intermediate",
      "instructions": "Stand facing a box or bench of an appropriate height with your feet together. This will be your starting position. Begin the movement by stepping up, putting your left foot on the top of the bench. Extend through the hip and knee of your front leg to stand up on the box. As you stand on the box with your left leg, flex your right knee and hip, bringing your knee as high as you can. Reverse this motion to step down off the box, and then repeat the sequence on the opposite leg.",
      "image": "https://media.self.com/photos/57aa008dd077f2273cf20476/master/w_1600%2Cc_limit/STEP_UP_KNEE_LIFT.gif"
    },
    {
      "name": "Kneeling Squat",
      "type": "powerlifting",
      "muscle": "glutes",
      "equipment": "barbell",
      "difficulty": "beginner",
      "instructions": "Set the bar to the proper height in a power rack. Kneel behind the bar; it may be beneficial to put a mat down to pad your knees. Slide under the bar, racking it across the back of your shoulders. Your shoulder blades should be retracted and the bar tight across your back. Unrack the weight. With your head looking forward, sit back with your butt until you touch your calves. Reverse the motion, returning the torso to an upright position.",
      "image": "https://assets.myworkouts.io/exercises-media/mGKGRBCHDAscPj8Bk/kneeling_squat_female_v16_gif_capoff.gif"
      
    },
    {
      "name": "Barbell Hip Thrust",
      "type": "powerlifting",
      "muscle": "glutes",
      "equipment": "barbell",
      "difficulty": "expert",
      "instructions": "Begin seated on the ground with a bench directly behind you. Have a loaded barbell over your legs. Using a fat bar or having a pad on the bar can greatly reduce the discomfort caused by this exercise. Roll the bar so that it is directly above your hips, and lean back against the bench so that your shoulder blades are near the top of it. Begin the movement by driving through your feet, extending your hips vertically through the bar. Your weight should be supported by your shoulder blades and your feet. Extend as far as possible, then reverse the motion to return to the starting position.",
      "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/barbell-exercises-hip-thrust-1549030719.gif?resize=480:*"
    }
  ]
}